Autodesk.Revit.DB.PointClouds.PointCloudFilterUtils.GetFilteredOutline(Autodesk.Revit.DB.PointClouds.PointCloudFilter,Autodesk.Revit.DB.Outline)
Computes outline of a part of a box that satisfies given PointCloudFilter.
filter:
Point cloud filter.
box:
A box aligned with coordinate axes.
Returns:
The bounding box of the set of all points within the original box that satisfy the filter.
Not every point within the resulting outline satisfies the filter, but any point that is contained
in the original box and satisfies the filter is guaranteed to be within the resulting outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.PointClouds.PointCloudFilterUtils
Utilities specific to point cloud filters.
Since:
2012